In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
data = np.array([[1, '홍일동', 166, 59, 19, '남'],
                 [2, '홍이동', 168, 600, 19, '여'],
                 [3, '홍삼동', 170, 33, 19, '남'],
                 [4, '홍사동', 172, 32, 19, '여'],
                 [5, '홍오동', 174, 30, 19, '남']])

In [6]:
pd.DataFrame(data=data, columns=['id', '이름', '키', '몸무게', '나이', '성별'])

  id   이름    키  몸무게  나이 성별
0  1  홍일동  166   59  19  남
1  2  홍이동  168  600  19  여
2  3  홍삼동  170   33  19  남
3  4  홍사동  172   32  19  여
4  5  홍오동  174   30  19  남

In [11]:
stu_df = pd.DataFrame(data=data, columns=['id', '이름', '키', '몸무게', '나이', '성별'])

In [12]:
stu_df.columns

Index(['id', '이름', '키', '몸무게', '나이', '성별'], dtype='object')

In [13]:
stu_df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
# help(stu_df.set_index)

In [18]:
stu_df.set_index('id', inplace=True)

In [19]:
stu_df

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   33  19  남
4   홍사동  172   32  19  여
5   홍오동  174   30  19  남

In [23]:
stu_df.iloc[0]

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [24]:
stu_df.loc['1']

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [25]:
stu_df['성별']

id
1    남
2    여
3    남
4    여
5    남
Name: 성별, dtype: object

In [26]:
stu_df[['키', '나이']]

      키  나이
id
1   166  19
2   168  19
3   170  19
4   172  19
5   174  19

In [27]:
stu_df.iloc[[1, 4]]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   30  19  남

In [29]:
stu_df.loc[['2', '5']]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   30  19  남

In [30]:
stu_df

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   33  19  남
4   홍사동  172   32  19  여
5   홍오동  174   30  19  남

In [32]:
stu_df.iloc[0, 0]

'홍일동'

In [33]:
stu_df.iloc[1, 2]

'600'

In [35]:
stu_df.loc['2']['몸무게']

'600'

In [37]:
stu_df['몸무게'][1]

C:\Users\kds\AppData\Local\Temp\ipykernel_11280\3178838982.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  stu_df['몸무게'][1]

'600'

In [38]:
stu_df.loc['3'][['몸무게', '나이']]

몸무게    33
나이     19
Name: 3, dtype: object

In [39]:
# 홍삼동,홍오동의 몸무게와 나이

In [41]:
stu_df.loc[['3', '5']][['몸무게', '나이']]

   몸무게  나이
id
3   33  19
5   30  19

In [46]:
stu_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      5 non-null      object
 1   키       5 non-null      object
 2   몸무게     5 non-null      object
 3   나이      5 non-null      object
 4   성별      5 non-null      object
dtypes: object(5)
memory usage: 412.0+ bytes

In [47]:
stu_df['키'].astype('int')

id
1    166
2    168
3    170
4    172
5    174
Name: 키, dtype: int32

In [49]:
stu_df['키'] = stu_df['키'].astype('int')

In [50]:
stu_df['키']

id
1    166
2    168
3    170
4    172
5    174
Name: 키, dtype: int32

In [51]:
stu_df['키'].dtype

dtype('int32')

In [52]:
stu_df['키'] >= 170

id
1    False
2    False
3     True
4     True
5     True
Name: 키, dtype: bool

In [57]:
stu_df['키'] >= 170

id
1    False
2    False
3     True
4     True
5     True
Name: 키, dtype: bool

In [58]:
stu_df['성별'] == '남'

id
1     True
2    False
3     True
4    False
5     True
Name: 성별, dtype: bool

In [53]:
stu_df[stu_df['키'] >= 170]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  33  19  남
4   홍사동  172  32  19  여
5   홍오동  174  30  19  남

In [67]:
# True && True

In [66]:
True & True

True

In [59]:
True and True

True

In [61]:
stu_df[stu_df['키'] >= 170]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  33  19  남
4   홍사동  172  32  19  여
5   홍오동  174  30  19  남

In [62]:
stu_df[stu_df['키'] >= 170][stu_df['성별'] == '남']

C:\Users\kds\AppData\Local\Temp\ipykernel_11280\2091365816.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  stu_df[stu_df['키'] >= 170][stu_df['성별'] == '남']

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  33  19  남
5   홍오동  174  30  19  남

In [64]:
import warnings

In [63]:
stu_df[stu_df['키'] >= 170][stu_df['성별'] == '남']['이름']

C:\Users\kds\AppData\Local\Temp\ipykernel_11280\178762299.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  stu_df[stu_df['키'] >= 170][stu_df['성별'] == '남']['이름']

id
3    홍삼동
5    홍오동
Name: 이름, dtype: object

In [69]:
stu_df[(stu_df['키'] >= 170) & (stu_df['성별'] == '남')]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  33  19  남
5   홍오동  174  30  19  남

In [72]:
stu_df['몸무게'].dtype

dtype('O')

In [73]:
stu_df['몸무게'] = stu_df['몸무게'].astype('int')

In [74]:
stu_df['몸무게'] >= 50

id
1     True
2     True
3    False
4    False
5    False
Name: 몸무게, dtype: bool

In [75]:
stu_df[(stu_df['몸무게'] >= 50) & (stu_df['성별'] == '여')]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여

In [76]:
stu_df[(stu_df['키'] < 170) & (stu_df['몸무게'] >= 50)]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여

In [77]:
stu_df[(stu_df['키'] < 170) | (stu_df['몸무게'] >= 50)]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여

In [78]:
pd.Series(['남', '여'])

0    남
1    여
dtype: object

In [81]:
di = {'a': 'apple', 'b': 'banan', 'c': 'candy'}

In [82]:
pd.Series(di)

a    apple
b    banan
c    candy
dtype: object

In [84]:
ser1 = pd.Series(di)

In [85]:
pd.DataFrame(ser1)

       0
a  apple
b  banan
c  candy

In [86]:
df_fruit = pd.DataFrame(ser1)

In [87]:
df_fruit.columns = ['fruit']

In [88]:
df_fruit

   fruit
a  apple
b  banan
c  candy

In [89]:
df_fruit.columns

Index(['fruit'], dtype='object')

In [93]:
# help(df_fruit.rename)

In [94]:
df_fruit.columns

Index(['fruit'], dtype='object')

In [95]:
df_fruit.index

Index(['a', 'b', 'c'], dtype='object')

In [96]:
df_fruit.columns = ['fruit2']

In [97]:
df_fruit

  fruit2
a  apple
b  banan
c  candy

In [98]:
di2 = {'a': 'anaconda', 'b': 'black_yart', 'c': 'cat'}

In [99]:
df_fruit['animal'] = di2

In [101]:
di3 = {'a': 'albatross', 'b': 'bald_eagle', 'c': 'crane'}

In [102]:
df_fruit['bird'] = di3

In [104]:
df_fruit

  fruit2      animal        bird
a  apple    anaconda   albatross
b  banan  black_yart  bald_eagle
c  candy         cat       crane

In [109]:
df_fruit.loc['c']['animal']

'cat'

In [111]:
df_fruit['animal']['c']

'cat'

In [113]:
df_fruit.iloc[2, 1]

'cat'

In [114]:
df_fruit.iloc[2, 1] = 'dog'

In [115]:
df_fruit

  fruit2      animal        bird
a  apple    anaconda   albatross
b  banan  black_yart  bald_eagle
c  candy         dog       crane

In [116]:
help(df_fruit.drop)

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel | None' = None, *, axis: 'Axis' = 0, index: 'IndexLabel | None' = None, columns: 'IndexLabel | None' = None, level: 'Level | None' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by directly specifying index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the :ref:`user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        in place and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        Returns DataFrame or None DataFrame with the specified
        index or column labels removed or None if inplace=True.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    llama   speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [121]:
df_fruit.drop('animal', axis=1, inplace=True)

In [122]:
df_fruit

  fruit2        bird
a  apple   albatross
b  banan  bald_eagle
c  candy       crane

In [123]:
df_fruit.drop('b', axis=0, inplace=True)

In [124]:
df_fruit

  fruit2       bird
a  apple  albatross
c  candy      crane